bio.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2025-12-03 -->
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Hi, Dan here!</title>
<meta name="author" content="Dan Dee" />
<meta name="description" content="Jack of all trades, master of some." />
<meta name="keywords" content="dan dee, interests, philosopher, designer, generalist, entrepreneur, multipotentialite, amateur" />
<meta name="generator" content="Org Mode" />
<meta http-equiv="Content-Security-Policy" content="default-src 'self'; script-src 'self' https://wa.skred.net/; connect-src https://wa.skred.net/; style-src 'self' https://*; font-src 'self' https://*; img-src 'self' https://*; media-src 'self' https://*;">
<meta name="google-site-verification" content="WUje0h1DXIUXINogHFZva1zk3Lw1oSpgrqva9dubYq0">
<link rel="stylesheet" href="/static/normalize.css" type="text/css">
<link rel="stylesheet" href="/static/org.css" type="text/css">
<link rel="stylesheet" href="/static/style.css" type="text/css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link href="https://fonts.googleapis.com/css2?family=Cormorant:wght@300&family=Gentium+Plus:ital,wght@0,400;0,700;1,400;1,700&family=PT+Sans+Caption:wght@400;700&family=PT+Sans+Narrow:wght@400;700&family=PT+Sans:ital,wght@0,400;0,700;1,400;1,700&display=swap" rel="stylesheet">
<link rel="stylesheet" href="/static/fonts/iosevka/fonts.css" type="text/css">
<link rel="icon" type="image/svg+xml" href="/static/monkeyjunglejuice.svg">
<link rel="apple-touch-icon" href="/static/monkeyjunglejuice-icon180.png">
<link rel="canonical" href="https://monkeyjunglejuice.github.io/bio.html">
</head>
<body>
<div id="preamble" class="status">
<nav id="nav-primary"><a id="site-name" href="/index.html">MonkeyJungleJuice</a> <a id="index" href="/index.html">Index</a><a id="bio" href="/bio.html">Bio</a><a id="github" href="https://github.com/monkeyjunglejuice">Github</a></nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Hi, Dan here!</h1>
<p class="subtitle" role="doc-subtitle">About me</p>
</header><p>
I&rsquo;ve got a love for examining phenomena from uncommon perspectives, cross-linking patterns, and a deep fascination for things &rsquo;bottom-up&rsquo;.<br>
</p>

<p>
Professionally, I&rsquo;m best described as a generalist designer and entrepreneur. Before co-founding a footwear brand and re-thinking shoes from the ground up, I specialized in brand design, UX/UI design, followed by conversion rate optimization &#x2013; this area intrigued me due to its empirical methods of analyzing human decision-making and the measurable impact of design on persuasion. Before that, I pursued a military career, where I made it to the rank of staff seargent in the military police; I was younger and much more stupid back then, but it also means I learned a lot from that experience.<br>
</p>

<p>
Considering myself by what I actually do most of the time, I&rsquo;m nowadays much more an &ldquo;amateur&rdquo; (in the original meaning of the word) rather than a &ldquo;professional&rdquo;. That&rsquo;s liberating for once; but more importantly, it makes life meaningful.<br>
</p>

<p>
The range of my interests is a bit all over the place:<br>
</p>
<ul class="org-ul">
<li>Metaphysics and Ontology<br></li>
<li>Computation and artificial life (not to confuse with &ldquo;AI&rdquo;)<br></li>
<li>Programming languages and paradigms, particularly Lisp<br></li>
<li>Emacs (check out my starterkit and Emacs themes on Github)<br></li>
<li>Longboarding and old-school skateboarding<br></li>
<li>Muay Thai training, philosophy and theory<br></li>
<li>Korean traditional archery<br></li>
</ul>

<p>
I care about:<br>
</p>
<ul class="org-ul">
<li>Animal welfare and animal rights<br></li>
<li>Preserving, restoring and improving the natural environment<br></li>
<li>Migitating anthropocentrism<br></li>
<li>Open source and free software<br></li>
</ul>

<hr>
<p>
CREDITS:<br>
Static site generator: <a href="https://www.gnu.org/software/emacs/">Emacs</a> with <a href="https://orgmode.org/features.html#publishing">Org-mode</a><br>
CSS frameworks: <a href="https://github.com/csstools/normalize.css">normalize.css</a> and <a href="https://github.com/oxalorg/sakura">sakura</a><br>
</p>
</div>
<div id="postamble" class="status">
<div class="footer">Published by <span class="author"><a href="/bio.html">Dan Dee</a></span></div>
<script defer src="/static/footer.js"></script>
</div>
</body>
</html>
